document.write(`1. Значення константи е = 2.718281828459045
<br>2. Значення константи π = 3.141592653589793
<br>3. Десятковий логарифм постійної Ейлера (е) = 0.4342944819032518
<br>4. Двійковий логарифм постійної Ейлера (е) = 1.4426950408889634
<br>5. Натуральний логарифм числа 10 = 2.302585092994046
<br>6. Натуральний логарифм числа 2 = 0.6931471805599453
<br>7. Корінь квадратний із двох = 1.4142135623730951
<br>8. Корінь квадратний з однієї другої = 0.7071067811865476 <br><br>`);

var y1 = Math.atan(1);
document.write("Результат обчислення арктангенса одиниці: y = " + y1 + "<br>");

var y2 = Math.exp(2);
document.write("Результат зведення е в степінь 2: y = " + y2 + "<br>");

var y3 = Math.log(Math.exp(2));
document.write("Натуральний логарифм від e2: y = " + y3 + "<br>");

var y4 = Math.log10(100);
document.write("Результат обчислення десяткового логарифма від числа 100: y = " + y4 + "<br>");

var y5 = Math.log2(8);
document.write("Результат обчислення двійкового логарифма від числа 8: y = " + y5);


document.write(`<br><br>`+Math.random());